## staging: api_gateway
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 5 to add, 6 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_account.main will be updated in-place
  ~ resource "aws_api_gateway_account" "main" {
      + cloudwatch_role_arn = (known after apply)
        id                  = "api-gateway-account"
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_deployment.metrics will be created
  + resource "aws_api_gateway_deployment" "metrics" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "rpjvmf2ukd"
      + triggers      = (known after apply)
    }

  # aws_api_gateway_method_settings.method_settings must be replaced
-/+ resource "aws_api_gateway_method_settings" "method_settings" {
      ~ id          = "rpjvmf2ukd-staging-save-metrics/POST" -> (known after apply)
      ~ method_path = "save-metrics/POST" -> "create_metrics/POST" # forces replacement
        # (2 unchanged attributes hidden)

      ~ settings {
          ~ cache_data_encrypted                       = false -> (known after apply)
          ~ cache_ttl_in_seconds                       = 300 -> (known after apply)
          ~ caching_enabled                            = false -> (known after apply)
          ~ data_trace_enabled                         = true -> (known after apply)
          ~ require_authorization_for_cache_control    = true -> (known after apply)
          ~ unauthorized_cache_control_header_strategy = "SUCCEED_WITH_RESPONSE_HEADER" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # aws_api_gateway_model.metrics_model will be updated in-place
  ~ resource "aws_api_gateway_model" "metrics_model" {
        id           = "p550fw"
        name         = "metricspayload"
      ~ schema       = jsonencode( # whitespace changes
            {
                $schema    = "http://json-schema.org/draft-04/schema#"
                properties = {
                    appos            = {
                        default   = "null"
                        maxLength = 20
                        minLength = 0
                        title     = "App os Schema"
                        type      = "string"
                    }
                    appversion       = {
                        default   = "null"
                        maxLength = 10
                        minLength = 0
                        title     = "App Version Schema"
                        type      = "string"
                    }
                    metricstimestamp = {
                        default   = "null"
                        maxLength = 25
                        minLength = 0
                        title     = "Metrics time stamp Schema"
                        type      = "integer"
                    }
                    payload          = {
                        default  = []
                        items    = {
                            default  = {}
                            required = [
                                "identifier",
                                "region",
                                "timestamp",
                            ]
                            title    = "payload Schema"
                            type     = "object"
                        }
                        minItems = 1
                        title    = "payload Schema"
                        type     = "array"
                    }
                    symptomonset     = {
                        title = "Symptom on set Schema"
                        type  = "boolean"
                    }
                }
                required   = [
                    "metricstimestamp",
                    "appversion",
                    "appos",
                    "payload",
                ]
                title      = "COVID Alert Metrics Schema Version 1.4.2"
                type       = "object"
            }
        )
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_request_validator.metrics_model will be updated in-place
  ~ resource "aws_api_gateway_request_validator" "metrics_model" {
        id                          = "ex8w8v"
      ~ name                        = "save-metrics-validator" -> "create_metrics-validator"
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_resource.create_resource will be updated in-place
  ~ resource "aws_api_gateway_resource" "create_resource" {
        id          = "v2izi2"
      ~ path_part   = "save-metrics" -> "create_metrics"
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_rest_api.metrics will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "metrics" {
        id                           = "rpjvmf2ukd"
      ~ name                         = "save-metrics" -> "create_metrics"
        tags                         = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_stage.metrics will be updated in-place
  ~ resource "aws_api_gateway_stage" "metrics" {
      ~ deployment_id         = "9n7bjn" -> (known after apply)
        id                    = "ags-rpjvmf2ukd-staging"
        tags                  = {}
        # (9 unchanged attributes hidden)

      + access_log_settings {
          + destination_arn = "arn:aws:logs:ca-central-1:005133826942:log-group:API-Gateway-Execution-Logs_rpjvmf2ukd/staging"
          + format          = jsonencode(
                {
                  + caller         = "$context.identity.caller"
                  + httpMethod     = "$context.httpMethod"
                  + ip             = "$context.identity.sourceIp"
                  + protocol       = "$context.protocol"
                  + requestId      = "$context.requestId"
                  + requestTime    = "$context.requestTime"
                  + resourcePath   = "$context.resourcePath"
                  + responseLength = "$context.responseLength"
                  + status         = "$context.status"
                  + user           = "$context.identity.user"
                }
            )
        }
    }

  # aws_iam_policy.metrics_apigateway_cloudwatch will be created
  + resource "aws_iam_policy" "metrics_apigateway_cloudwatch" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "MetricsApigatewayCloudwatch"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:GetLogEvents",
                          + "logs:FilterLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DescribeLogGroups",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.metrics_api_gateway_cloudwatch_role must be replaced
-/+ resource "aws_iam_role" "metrics_api_gateway_cloudwatch_role" {
      ~ arn                   = "arn:aws:iam::005133826942:role/save-metricsapi_gateway_cloudwatch_role" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "apigateway.amazonaws.com"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2021-02-04T20:16:05Z" -> (known after apply)
      ~ id                    = "save-metricsapi_gateway_cloudwatch_role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "save-metricsapi_gateway_cloudwatch_role" -> "metrics_api_gateway_cloudwatch_role" # forces replacement
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROAQCMP77N7EGPV6QUAX" -> (known after apply)
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "default" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogGroup",
                              - "logs:CreateLogStream",
                              - "logs:DescribeLogGroups",
                              - "logs:DescribeLogStreams",
                              - "logs:PutLogEvents",
                              - "logs:GetLogEvents",
                              - "logs:FilterLogEvents",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.metrics_api_gateway_cloudwatch will be created
  + resource "aws_iam_role_policy_attachment" "metrics_api_gateway_cloudwatch" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "metrics_api_gateway_cloudwatch_role"
    }

Plan: 5 to add, 6 to change, 2 to destroy.

Changes to Outputs:
  + base_url = (known after apply)

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>